def to_latin(text):
    mapping = {
        'А': 'A', 'а': 'a', 'Б': 'B', 'б': 'b', 'Д': 'D', 'д': 'd',
        'Е': 'E', 'е': 'e', 'Ф': 'F', 'ф': 'f', 'Г': 'G', 'г': 'g',
        'Ҳ': 'H', 'ҳ': 'h', 'И': 'I', 'и': 'i', 'Ж': 'J', 'ж': 'j',
        'К': 'K', 'к': 'k', 'Л': 'L', 'л': 'l', 'М': 'M', 'м': 'm',
        'Н': 'N', 'н': 'n', 'О': 'O', 'о': 'o', 'П': 'P', 'п': 'p',
        'Қ': 'Q', 'қ': 'q', 'Р': 'R', 'р': 'r', 'С': 'S', 'с': 's',
        'Т': 'T', 'т': 't', 'У': 'U', 'у': 'u', 'В': 'V', 'в': 'v',
        'Х': 'X', 'х': 'x', 'Й': 'Y', 'й': 'y', 'З': 'Z', 'з': 'z',
        'Ш': 'Sh', 'ш': 'sh', 'Ч': 'Ch', 'ч': 'ch', 'Ю': 'Yu', 'ю': 'yu',
        'Я': 'Ya', 'я': 'ya', 'Ё': 'Yo', 'ё': 'yo', 'Ц': 'S', 'ц': 's',
        'Ъ': '', 'ъ': '', 'Ь': '', 'ь': '', 'Э': 'E', 'э': 'e',
        'Ў': 'O‘', 'ў': 'o‘', 'Ғ': 'G‘', 'ғ': 'g‘'
    }

    for cyrillic, latin in mapping.items():
        text = text.replace(cyrillic, latin)
    return text
